ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/ЗаявленияНаПриемВСпортивноеУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПриемВСпортивноеУчреждение</name>
  <registerRecords>InformationRegister.ПредоставленныеДокументыСпортсменов</registerRecords>
  <registerRecords>InformationRegister.СоставУчащихсяСпортивногоУчреждения</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностиРазвитияИЗдоровьяСпортсмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаОбработкуПерсональныхДанныхПолучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСогласиеНаОбработкуПерсональныхДанных</name>
    <type>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерновикЗаявления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.СтатусыЗаявленийНаПриемВСпортивноеУчреждение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоИзВнешнегоИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредоставленныеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыДокументовДляПриемаВСпортивноеУчреждение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоставленаКопия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлДокумента</name>
      <type>
        <types>CatalogRef.ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </resources>
  <resources>
    <name>Гражданство</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/СоставыСемейСпортсменов/СоставыСемейСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставыСемейСпортсменов</name>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтепеньРодства</name>
    <type>
      <types>CatalogRef.СтепениРодстваФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/ПредоставленныеДокументыСпортсменов/ПредоставленныеДокументыСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредоставленныеДокументыСпортсменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПредоставленаКопия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовДляПриемаВСпортивноеУчреждение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическогоЛица</name>
  <enumValues>
    <name>Женский</name>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/ManagerModule.bsl
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	// {Рарус adilas #-0 -Контроль доступа, без задачи 2020.10.21
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	""СоставУчащихсяСпортивногоУчреждения"" КАК ИмяРегистра_,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.Спортсмен КАК Спортсмен,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.Организация КАК Организация,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.ВидСпорта КАК ВидСпорта,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.ДатаЗаявления КАК ДатаНачалаОбучения,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.ДатаПриказа КАК ДатаПриказа,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.НомерПриказа КАК НомерПриказа,
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.ДатаЗаявления КАК Период
					|ИЗ
	                |	Документ.ЗаявленияНаПриемВСпортивноеУчреждение КАК ЗаявленияНаПриемВСпортивноеУчреждение
	                |ГДЕ
	                |	ЗаявленияНаПриемВСпортивноеУчреждение.Ссылка = &Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""ПредоставленныеДокументыСпортсменов"" КАК ИмяРегистра_,
	                |	ЗаявленияПредоставленныеДокументы.ВидДокумента КАК ВидДокумента,
	                |	ЗаявленияПредоставленныеДокументы.ПредоставленаКопия КАК ПредоставленаКопия,
	                |	ЗаявленияПредоставленныеДокументы.Ссылка.Организация КАК Организация,
	                |	ЗаявленияПредоставленныеДокументы.Ссылка.Спортсмен КАК Спортсмен,
	                |	ЗаявленияПредоставленныеДокументы.Ссылка.ВидСпорта КАК ВидСпорта,
	                |	ЗаявленияПредоставленныеДокументы.Ссылка.ДатаЗаявления КАК ДатаЗаявления,
	                |	ЗаявленияПредоставленныеДокументы.Ссылка.ДатаЗаявления КАК Период
	                |ИЗ
	                |	Документ.ЗаявленияНаПриемВСпортивноеУчреждение.ПредоставленныеДокументы КАК ЗаявленияПредоставленныеДокументы
	                |ГДЕ
	                |	ЗаявленияПредоставленныеДокументы.Ссылка = &Ссылка";
	
	
	ТаблицаСоставУчащихсяСпортивногоУчреждения = Запрос.ВыполнитьПакет()[0].Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСоставУчащихсяСпортивногоУчреждения" , ТаблицаСоставУчащихсяСпортивногоУчреждения);
	
	ТаблицаПредоставленныеДокументыСпортсменов = Запрос.ВыполнитьПакет()[1].Выгрузить();
	ТаблицыДляДвижений.Вставить("ТаблицаПредоставленныеДокументыСпортсменов" , ТаблицаПредоставленныеДокументыСпортсменов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявленияНаПриемВСпортивноеУчреждение.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявленияНаПриемВСпортивноеУчреждение.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ЗаявленияНаПриемВСпортивноеУчреждение.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаПриемВСпортивноеУчреждение") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявлениеНаПриемВСпортивноеУчреждение", "Заявление на прием в спортивное учреждение", СформироватьПечатнуюФорму(МассивОбъектов));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаПриемТабДок") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявлениеНаПриемТабДок", "Заявление на прием в спортивное учреждение", СформироватьПечатнуюФормуЗаявление(МассивОбъектов));
		
	КонецЕсли;

	
КонецПроцедуры

Функция СформироватьПечатнуюФорму(МассивОбъектовДляПечати) Экспорт
	
	Если ТипЗнч(МассивОбъектовДляПечати) = Тип("Массив") Тогда
		
		МассивОбъектов = МассивОбъектовДляПечати;
		
	Иначе
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(МассивОбъектовДляПечати);
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов",  МассивОбъектов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА НЕ ЗаявленияНаПриемВСпортивноеУчреждение.Организация.ПолноеНаименование = """"
	               |			ТОГДА ЗаявленияНаПриемВСпортивноеУчреждение.Организация.ПолноеНаименование
	               |		ИНАЧЕ ЗаявленияНаПриемВСпортивноеУчреждение.Организация
	               |	КОНЕЦ КАК ПолноеНаименованиеОрганизации,
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.ВидСпорта КАК ВидСпорта,
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.Родитель КАК Заявитель,
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.Дата КАК ДатаДокумента,
	               |	КонтактнаяИнформацияАдресПроживания.Представление КАК АдресПроживанияЗаявителя,
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.Спортсмен КАК Спортсмен,
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.Ссылка КАК ДокументСсылка,
	               |	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
	               |	РАЗНОСТЬДАТ(ЕСТЬNULL(ФизическиеЛица.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)), ЗаявленияНаПриемВСпортивноеУчреждение.Дата, ГОД) КАК Возраст,
	               |	КонтактнаяИнформацияАдресПроживанияСпортсмена.Представление КАК АдресПроживанияСпортсмена,
	               |	ФизическиеЛица.Пол КАК Пол
	               |ПОМЕСТИТЬ ВТ_ДанныеПоДокументу
	               |ИЗ
	               |	Документ.ЗаявленияНаПриемВСпортивноеУчреждение КАК ЗаявленияНаПриемВСпортивноеУчреждение
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресПроживания
	               |		ПО ЗаявленияНаПриемВСпортивноеУчреждение.Родитель = КонтактнаяИнформацияАдресПроживания.Ссылка
	               |			И (КонтактнаяИнформацияАдресПроживания.Вид = ЗНАЧЕНИЕ(справочник.видыконтактнойинформации.АдресМестаПроживанияФизическиеЛица))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО ЗаявленияНаПриемВСпортивноеУчреждение.Спортсмен.ФизическоеЛицо = ФизическиеЛица.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияАдресПроживанияСпортсмена
	               |		ПО ЗаявленияНаПриемВСпортивноеУчреждение.Спортсмен.ФизическоеЛицо = КонтактнаяИнформацияАдресПроживанияСпортсмена.Ссылка
	               |			И (КонтактнаяИнформацияАдресПроживанияСпортсмена.Вид = ЗНАЧЕНИЕ(справочник.видыконтактнойинформации.АдресМестаПроживанияФизическиеЛица))
	               |ГДЕ
	               |	ЗаявленияНаПриемВСпортивноеУчреждение.Ссылка В(&МассивДокументов)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоДокументу.Заявитель КАК Заявитель,
	               |	МАКСИМУМ(ДокументыФизическихЛиц.Период) КАК Период
	               |ПОМЕСТИТЬ ВТ_МаксДокументыЗаявителей
	               |ИЗ
	               |	ВТ_ДанныеПоДокументу КАК ВТ_ДанныеПоДокументу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	               |		ПО ВТ_ДанныеПоДокументу.Заявитель = ДокументыФизическихЛиц.ФизическоеЛицо
	               |			И ВТ_ДанныеПоДокументу.ДатаДокумента >= ДокументыФизическихЛиц.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеПоДокументу.Заявитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_МаксДокументыЗаявителей.Заявитель КАК Заявитель,
	               |	ДокументыФизическихЛиц.ВидДокумента КАК ДокументЗаявителя,
	               |	ДокументыФизическихЛиц.Серия КАК Серияаявителя,
	               |	ДокументыФизическихЛиц.Номер КАК Номераявителя,
	               |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачиаявителя,
	               |	ДокументыФизическихЛиц.КемВыдан КАК КемВыданаявителя
	               |ПОМЕСТИТЬ ВТ_ДокументыЗаЯвителей
	               |ИЗ
	               |	ВТ_МаксДокументыЗаявителей КАК ВТ_МаксДокументыЗаявителей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	               |		ПО ВТ_МаксДокументыЗаявителей.Заявитель = ДокументыФизическихЛиц.ФизическоеЛицо
	               |			И ВТ_МаксДокументыЗаявителей.Период = ДокументыФизическихЛиц.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоДокументу.Спортсмен КАК Спортсмен,
	               |	МАКСИМУМ(ДокументыФизическихЛиц.Период) КАК Период
	               |ПОМЕСТИТЬ ВТ_МаксДокументыСпортсменов
	               |ИЗ
	               |	ВТ_ДанныеПоДокументу КАК ВТ_ДанныеПоДокументу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	               |		ПО ВТ_ДанныеПоДокументу.Спортсмен.ФизическоеЛицо = ДокументыФизическихЛиц.ФизическоеЛицо
	               |			И ВТ_ДанныеПоДокументу.ДатаДокумента >= ДокументыФизическихЛиц.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеПоДокументу.Спортсмен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_МаксДокументыСпортсменов.Спортсмен КАК Спортсмен,
	               |	ДокументыФизическихЛиц.ВидДокумента КАК ДокументСпортсмена,
	               |	ДокументыФизическихЛиц.Серия КАК СерияСпортсмена,
	               |	ДокументыФизическихЛиц.Номер КАК НомерСпортсмена,
	               |	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачиСпортсмена,
	               |	ДокументыФизическихЛиц.КемВыдан КАК КемВыданСпортсмена
	               |ПОМЕСТИТЬ ВТ_ДокументыСпортсменов
	               |ИЗ
	               |	ВТ_МаксДокументыСпортсменов КАК ВТ_МаксДокументыСпортсменов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	               |		ПО ВТ_МаксДокументыСпортсменов.Спортсмен.ФизическоеЛицо = ДокументыФизическихЛиц.ФизическоеЛицо
	               |			И ВТ_МаксДокументыСпортсменов.Период = ДокументыФизическихЛиц.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеПоДокументу.Организация КАК Организация,
	               |	ВТ_ДанныеПоДокументу.ПолноеНаименованиеОрганизации КАК ПолноеНаименованиеОрганизации,
	               |	ВТ_ДанныеПоДокументу.ВидСпорта КАК ВидСпорта,
	               |	ВТ_ДанныеПоДокументу.Заявитель КАК Заявитель,
	               |	ВТ_ДанныеПоДокументу.ДатаДокумента КАК ДатаДокумента,
	               |	ВТ_ДанныеПоДокументу.АдресПроживанияЗаявителя КАК АдресПроживанияЗаявителя,
	               |	ВТ_ДанныеПоДокументу.Спортсмен КАК Спортсмен,
	               |	ВТ_ДанныеПоДокументу.ДокументСсылка КАК ДокументСсылка,
	               |	ВТ_ДанныеПоДокументу.ДатаРождения КАК ДатаРождения,
	               |	ВТ_ДанныеПоДокументу.Возраст КАК Возраст,
	               |	ВТ_ДанныеПоДокументу.АдресПроживанияСпортсмена КАК АдресПроживанияСпортсмена,
	               |	ВТ_ДокументыЗаЯвителей.ДокументЗаявителя КАК ДокументЗаявителя,
	               |	ВТ_ДокументыЗаЯвителей.Серияаявителя КАК СерияЗаявителя,
	               |	ВТ_ДокументыЗаЯвителей.Номераявителя КАК НомерЗаявителя,
	               |	ВТ_ДокументыЗаЯвителей.ДатаВыдачиаявителя КАК ДатаВыдачиЗаявителя,
	               |	ВТ_ДокументыЗаЯвителей.КемВыданаявителя КАК КемВыданЗаявителя,
	               |	ВТ_ДокументыСпортсменов.ДокументСпортсмена КАК ДокументСпортсмена,
	               |	ВТ_ДокументыСпортсменов.СерияСпортсмена КАК СерияСпортсмена,
	               |	ВТ_ДокументыСпортсменов.НомерСпортсмена КАК НомерСпортсмена,
	               |	ВТ_ДокументыСпортсменов.ДатаВыдачиСпортсмена КАК ДатаВыдачиСпортсмена,
	               |	ВТ_ДокументыСпортсменов.КемВыданСпортсмена КАК КемВыданСпортсмена,
	               |	ВТ_ДанныеПоДокументу.Пол КАК Пол
	               |ИЗ
	               |	ВТ_ДанныеПоДокументу КАК ВТ_ДанныеПоДокументу
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыЗаЯвителей КАК ВТ_ДокументыЗаЯвителей
	               |		ПО ВТ_ДанныеПоДокументу.Заявитель = ВТ_ДокументыЗаЯвителей.Заявитель
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыСпортсменов КАК ВТ_ДокументыСпортсменов
	               |		ПО ВТ_ДанныеПоДокументу.Спортсмен = ВТ_ДокументыСпортсменов.Спортсмен
	               |ИТОГИ ПО
	               |	ДокументСсылка";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявленияНаПриемВСпортивноеУчреждение.ЗаявлениеНаПриемВСпортивноеУчреждение");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Выборка = ВыборкаДокумент.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
			ОрганизацияПП = "";
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(СокрЛП(Выборка.Организация),6,ОрганизацияПП);
			ОбластьШапка.Параметры.Организация  = ОрганизацияПП;
			ПолноеНаименованиеОрганизацииПП = "";
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(СокрЛП(Выборка.ПолноеНаименованиеОрганизации),6,ПолноеНаименованиеОрганизацииПП);
			ОбластьШапка.Параметры.ПолноеНаименованиеОрганизации = ПолноеНаименованиеОрганизацииПП;
			ЗавительСовершеннолетний = ?(Выборка.Возраст > 18, Истина, Ложь);
			Заявитель = ?(ЗавительСовершеннолетний, Выборка.Спортсмен, Выборка.Заявитель);
			ЗаявительРП = "";
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(СокрЛП(Заявитель),2,ЗаявительРП);
			ОбластьШапка.Параметры.Заявитель = ЗаявительРП;
			Если ЗавительСовершеннолетний Тогда
				ДокументЗавителя = СокрЛП(Выборка.ДокументСпортсмена) + " серия " + СокрЛП(Выборка.СерияСпортсмена) + " № " + СокрЛП(Выборка.НомерСпортсмена) + " выдан " + Формат(Выборка.ДатаВыдачиСпортсмена,"ДЛФ=Д") +
				" " + СокрЛП(Выборка.КемВыданСпортсмена);
			Иначе
				ДокументЗавителя = СокрЛП(Выборка.ДокументЗаявителя) + " серия " + СокрЛП(Выборка.СерияЗаявителя) + " № " + СокрЛП(Выборка.НомерЗаявителя) + " выдан " + Формат(Выборка.ДатаВыдачиЗаявителя,"ДЛФ=Д") +
				" " + СокрЛП(Выборка.КемВыданЗаявителя);
			КонецЕсли;	
			ОбластьШапка.Параметры.ДокументЗаявителя = ДокументЗавителя;
			ОбластьШапка.Параметры.АдресПроживанияЗаявителя = ?(ЗавительСовершеннолетний,Выборка.АдресПроживанияСпортсмена,Выборка.АдресПроживанияЗаявителя);
			Если ЗавительСовершеннолетний Тогда
				Кого = "меня";
			ИначеЕсли Выборка.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
				Кого = "мою дочь";
			Иначе
				Кого = "моего сына";
			КонецЕсли;
			ОбластьШапка.Параметры.Кого = Кого;
			ФИОСпортсменаВП = "";
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(СокрЛП(Выборка.Спортсмен),4,ФИОСпортсменаВП);
			ОбластьШапка.Параметры.ФИОСпортсмена = ФИОСпортсменаВП;
			ОбластьШапка.Параметры.ДатаРождения = Формат(Выборка.ДатаРождения,"ДЛФ=Д");
			ОбластьШапка.Параметры.ДокументСпортсмена = СокрЛП(Выборка.ДокументСпортсмена) + " серия " + СокрЛП(Выборка.СерияСпортсмена) + " № " + СокрЛП(Выборка.НомерСпортсмена) + " выдан " + Формат(Выборка.ДатаВыдачиСпортсмена,"ДЛФ=Д") +
				" " + СокрЛП(Выборка.КемВыданСпортсмена);
			ВидСпортаДП = "";
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(СокрЛП(Выборка.ВидСпорта),3,ВидСпортаДП);
			ОбластьШапка.Параметры.ВидСпорта = ВидСпортаДП;
					
			ОрганизацияРП = "";
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(СокрЛП(Выборка.Организация),2,ОрганизацияРП);
			ОбластьШапка.Параметры.Организации  = ОрганизацияРП;
			ТабДок.Вывести(ОбластьШапка);
			
			Для Индекс = 0 По Выборка.ДокументСсылка.ПредоставленныеДокументы.Количество()-1 Цикл
				ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрокаДокумента");
				ОбластьСтрока.Параметры.НомерПоПорядку = Индекс+1;
				ОбластьСтрока.Параметры.ВидДокумента = Выборка.ДокументСсылка.ПредоставленныеДокументы[Индекс].ВидДокумента;
				ТабДок.Вывести(ОбластьСтрока);
			КонецЦикла;
			
			ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
			ОбластьПодвал.Параметры.Дата = Формат(Выборка.ДатаДокумента,"ДЛФ=ДД");
			ТабДок.Вывести(ОбластьПодвал);
			
		КонецЦикла;	
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;	
	
	ТабДок.КлючПараметровПечати	= "Документ.ЗаявленияНаПриемВСпортивноеУчреждение.ЗаявлениеНаПриемВСпортивноеУчреждение";
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб 			= Истина;
	
	Возврат ТабДок;
	
	
КонецФункции	

// {Рарус dotere #19208 -Печатная форма 2021.08.26

Функция СформироватьПечатнуюФормуЗаявление(МассивОбъектовДляПечати) Экспорт
	
	Если ТипЗнч(МассивОбъектовДляПечати) = Тип("Массив") Тогда
		
		МассивОбъектов = МассивОбъектовДляПечати;
		
	Иначе
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(МассивОбъектовДляПечати);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Ссылка КАК СсылкаДокумента,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Родитель КАК Родитель,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Организация КАК Организация,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.ВидСпорта КАК ВидСпорта,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.ДатаЗаявления КАК ДатаЗаявления,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Спортсмен КАК Спортсмен
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.ЗаявленияНаПриемВСпортивноеУчреждение КАК ЗаявленияНаПриемВСпортивноеУчреждение
		|ГДЕ
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Документ.Спортсмен КАК Спортсмен,
		|	ВТ_Документ.Родитель КАК Родитель,
		|	ВТ_Документ.Организация КАК Организация,
		|	ВТ_Документ.ВидСпорта КАК ВидСпорта,
		|	ВТ_Документ.ДатаЗаявления КАК ДатаЗаявления,
		|	ВТ_Документ.СсылкаДокумента КАК СсылкаДокумента
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спортсмены КАК Спортсмены
		|		ПО ВТ_Документ.Спортсмен = Спортсмены.Ссылка
		|ИТОГИ ПО
		|	СсылкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Тип КАК Тип,
		|	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление,
		|	ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|		ПО ФизическиеЛица.Ссылка = ФизическиеЛицаКонтактнаяИнформация.Ссылка
		|ГДЕ
		|	(ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|			ИЛИ ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставыСемейСпортсменов.Родитель КАК Родитель,
		|	СоставыСемейСпортсменов.СтепеньРодства КАК СтепеньРодства,
		|	СоставыСемейСпортсменов.Спортсмен КАК Спортсмен
		|ИЗ
		|	РегистрСведений.СоставыСемейСпортсменов КАК СоставыСемейСпортсменов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка КАК Ссылка,
		|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
		|	ДокументыФизическихЛиц.Серия КАК Серия,
		|	ДокументыФизическихЛиц.Номер КАК Номер,
		|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи,
		|	ДокументыФизическихЛиц.СрокДействия КАК СрокДействия,
		|	ДокументыФизическихЛиц.КемВыдан КАК КемВыдан,
		|	ДокументыФизическихЛиц.КодПодразделения КАК КодПодразделения,
		|	ДокументыФизическихЛиц.Документ КАК Документ,
		|	ДокументыФизическихЛиц.Гражданство КАК Гражданство
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|		ПО (ДокументыФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Спортсмены.Ссылка КАК Ссылка,
		|	ПредоставленныеДокументыСпортсменовСрезПоследних.ВидДокумента КАК ВидДокумента
		|ИЗ
		|	Справочник.Спортсмены КАК Спортсмены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредоставленныеДокументыСпортсменов.СрезПоследних КАК ПредоставленныеДокументыСпортсменовСрезПоследних
		|		ПО (ПредоставленныеДокументыСпортсменовСрезПоследних.Спортсмен = Спортсмены.Ссылка)";
	
	ПутьКМакету = "Документ.ЗаявленияНаПриемВСпортивноеУчреждение.ЗаявлениеНаПриемТабДок";
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету);
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьРодительЗаголовок = Макет.ПолучитьОбласть("ОбластьРодительЗаголовок");
	ОбластьРодитель = Макет.ПолучитьОбласть("ОбластьРодитель");
	ОбластьПриложенияНадпись = Макет.ПолучитьОбласть("ОбластьПриложенияНадпись");
	ОбластьПриложения = Макет.ПолучитьОбласть("ОбластьПриложения");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодавл");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоЗапросов = РезультатЗапроса.Количество();
	
	ВыборкаСсылка = РезультатЗапроса[КоличествоЗапросов - 5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКонтактнаяИнформация = РезультатЗапроса[КоличествоЗапросов - 4].Выбрать();
	ВыборкаРодители = РезультатЗапроса[КоличествоЗапросов - 3].Выбрать();
	ВыборкаДокументы = РезультатЗапроса[КоличествоЗапросов - 2].Выбрать();
	ВыборкаПредоставленныеДокументы = РезультатЗапроса[КоличествоЗапросов - 1].Выбрать();
	
	СтруктураПоиска = Новый Структура("Ссылка");
	СтруктураПоискаСпортсмен = Новый Структура("Ссылка");
	СтруктураПоискаРодителей = Новый Структура("Спортсмен");
	СтруктруаПоискаДанныхРодителей = Новый Структура();
	СтруктруаПоискаДанныхРодителей.Вставить("Ссылка");
	СтруктруаПоискаДанныхРодителей.Вставить("Вид");
	Пока ВыборкаСсылка.Следующий() Цикл
		 ОбластьШапка.Параметры.Директор = Строка(ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ВыборкаСсылка.СсылкаДокумента.Организация.Директор));
		 ОбластьШапка.Параметры.СокрОрганизация = ВыборкаСсылка.СсылкаДокумента.Организация;
		 ОбластьШапка.Параметры.ЗаконныйПредставитель = СклонениеПредставленийОбъектов.ПросклонятьФИО(ВыборкаСсылка.СсылкаДокумента.Родитель.ФизическоеЛицо,2);
		 ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			 СтруктураПоиска.Ссылка = ВыборкаДетальныеЗаписи.Родитель.ФизическоеЛицо.Ссылка;
			 Пока ВыборкаКонтактнаяИнформация.НайтиСледующий(СтруктураПоиска) Цикл
				 Если ВыборкаКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица Тогда
					 jsonПрописка = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаКонтактнаяИнформация.Ссылка, 
						Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица, ТекущаяДатаСеанса(), Ложь);
					 ДанныеМестаПрописки = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(jsonПрописка[0].Значение);
					 Если Не ДанныеМестаПрописки.addressType = "ВСвободнойФорме" Тогда
						 НомерКвартиры = "";
						 Если Не ДанныеМестаПрописки.apartments.Количество()=0 Тогда
						 НомерКвартиры = " кв. " + ДанныеМестаПрописки.apartments[0].number;
					 	 КонецЕсли;
					 	 ОбластьШапка.Параметры.АдресПрописки = "г. " + ДанныеМестаПрописки.city + " ул. " + ДанныеМестаПрописки.street + " дом " + ДанныеМестаПрописки.houseNumber + НомерКвартиры;  
					 Иначе
						 ОбластьШапка.Параметры.АдресПрописки = ДанныеМестаПрописки.value;
					 КонецЕсли
				 КонецЕсли;
			 КонецЦикла;
			 ВыборкаКонтактнаяИнформация.Сбросить();
			 СтруктураПоискаСпортсмен.Ссылка = ВыборкаДетальныеЗаписи.Спортсмен.ФизическоеЛицо.Ссылка;
			 Пока ВыборкаКонтактнаяИнформация.НайтиСледующий(СтруктураПоискаСпортсмен) Цикл
			 	 Если ВыборкаКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица Тогда
					 json = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаКонтактнаяИнформация.Ссылка, 
						Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица, ТекущаяДатаСеанса(), Ложь);
					 ДанныеМестаЖительства = УправлениеКонтактнойИнформациейСлужебный.СтрокуJSONВСтруктуру(json[0].Значение);
					 Если Не ДанныеМестаЖительства.addressType = "ВСвободнойФорме" Тогда
					 Если Не ДанныеМестаЖительства.apartments.Количество()=0 Тогда
						 квартира = ", кв " + ДанныеМестаЖительства.apartments[0].number;
					 КонецЕсли;
					 ОбластьШапка.Параметры.АдресПроживания = "г "+ДанныеМестаЖительства.city + ", дом №"+ДанныеМестаЖительства.houseNumber + квартира;
					 Иначе
						ОбластьШапка.Параметры.АдресПроживания = ДанныеМестаЖительства.value;
					 КонецЕсли
				 КонецЕсли
			 КонецЦикла;
			 ОбластьШапка.Параметры.ПолноеНаименование = ВыборкаДетальныеЗаписи.Организация.ПолноеНаименование;
			 ОбластьШапка.Параметры.ВидСпорта = ВыборкаДетальныеЗаписи.ВидСпорта;
			 ОбластьШапка.Параметры.Спортсмен = СклонениеПредставленийОбъектов.ПросклонятьФИО(ВыборкаДетальныеЗаписи.Спортсмен.ФизическоеЛицо,2);
			 ОбластьШапка.Параметры.ДатаРождения = Формат(ВыборкаДетальныеЗаписи.Спортсмен.ФизическоеЛицо.ДатаРождения,"ДЛФ=DD");
			 СтруктураПоиска.Ссылка = ВыборкаДетальныеЗаписи.Спортсмен.ФизическоеЛицо;
			 Гражданство = "";
			 Пока ВыборкаДокументы.НайтиСледующий(СтруктураПоиска) Цикл
				 Если Гражданство = "" И ВыборкаДокументы.Гражданство <> null Тогда
					  ОбластьШапка.Параметры.Гражданство = СклонениеПредставленийОбъектов.ПросклонятьПредставление(ВыборкаДокументы.Гражданство.НаименованиеПолное,2);
				 КонецЕсли
			 КонецЦикла;
			 ТабДок.Вывести(ОбластьШапка);
			 СтруктураПоискаРодителей.Спортсмен = ВыборкаДетальныеЗаписи.Спортсмен;
			 ВыборкаКонтактнаяИнформация.Сбросить();
			 Заголовок = Истина;
			 Пока ВыборкаРодители.НайтиСледующий(СтруктураПоискаРодителей) Цикл
				 Если Заголовок Тогда
					ТабДок.Вывести(ОбластьРодительЗаголовок);
					Заголовок = Ложь;
				 КонецЕсли;
				 ОбластьРодитель.Параметры.Родитель = ВыборкаРодители.Родитель;
				 ОбластьРодитель.Параметры.СтепеньРодства = ВыборкаРодители.СтепеньРодства;
				 СтруктруаПоискаДанныхРодителей.Ссылка = ВыборкаРодители.Родитель.ФизическоеЛицо.Ссылка;
				 СтруктруаПоискаДанныхРодителей.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
				 Пока ВыборкаКонтактнаяИнформация.НайтиСледующий(СтруктруаПоискаДанныхРодителей) Цикл
					ОбластьРодитель.Параметры.Телефон = ВыборкаКонтактнаяИнформация.Представление;
				 КонецЦикла;
				 ТабДок.Вывести(ОбластьРодитель);
			 КонецЦикла;
			 ВыборкаДокументы.Сбросить();
			 Заголовок = Истина;
			 СтруктураПоиска.Ссылка = ВыборкаДетальныеЗаписи.Спортсмен;
			 Пока ВыборкаПредоставленныеДокументы.НайтиСледующий(СтруктураПоиска) Цикл
				 Если ВыборкаПредоставленныеДокументы.ВидДокумента <> null Тогда
					 Если Заголовок Тогда
						 ТабДок.Вывести(ОбластьПриложенияНадпись);
						 Заголовок = Ложь;
					 КонецЕсли;
					 ОбластьПриложения.Параметры.ДокументПриложения = ВыборкаПредоставленныеДокументы.ВидДокумента;
					 ТабДок.Вывести(ОбластьПриложения);
				 КонецЕсли;
			 КонецЦикла;
			 ОбластьПодвал.Параметры.ПолноеНаименование = ВыборкаДетальныеЗаписи.Организация.ПолноеНаименование;
			 ОбластьПодвал.Параметры.ДатаДокумента = Формат(ВыборкаДетальныеЗаписи.ДатаЗаявления,"ДЛФ=D");
			 ТабДок.Вывести(ОбластьПодвал);
			 
		 КонецЦикла;
	 	
		 ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();	
	
	ТабДок.КлючПараметровПечати	= ПутьКМакету;
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб 			= Истина;
	
	Возврат ТабДок;
	
КонецФункции


// }Рарус dotere #19208 -Печатная форма 2021.08.26

#КонецОбласти
